In [47]:
# Initial imports
import pandas as pd
import hvplot.pandas
from path import Path
import plotly.express as px
from sklearn.preprocessing import StandardScaler, MinMaxScaler
from sklearn.decomposition import PCA
from sklearn.cluster import KMeans

In [48]:
# Load the Housing_data.csv dataset.
file_path = "Resources/housing_data_cleaned.csv"
housing_df = pd.read_csv(file_path)
print(housing_df.shape)
housing_df.head(5)

(55020, 11)

,date,metro_area/city,median_listing_price,active_listing_count,median_days_on_market,new_listing_count,price_increased_count,price_reduced_count,pending_listing_count,average_listing_price,total_listing_count
0,2021-06-01,"new york-newark-jersey city, ny-nj-pa",617500.0,61846,55.0,26280,1020,9540,32230,1.260094e+06,94076
1,2021-06-01,"los angeles-long beach-anaheim, ca",1024500.0,13258,44.0,10096,476,1928,15494,2.507311e+06,28752
2,2021-06-01,"chicago-naperville-elgin, il-in-wi",354950.0,19089,33.0,17088,444,5712,25296,5.380922e+05,44385
3,2021-06-01,"dallas-fort worth-arlington, tx",387000.0,6850,29.0,9008,704,1924,14504,5.952097e+05,21354
4,2021-06-01,"houston-the woodlands-sugar land, tx",365995.0,13440,36.0,11368,1748,3636,17155,5.565350e+05,30595

In [49]:
housing_df.dtypes

date                      object
metro_area/city           object
median_listing_price     float64
active_listing_count       int64
median_days_on_market    float64
new_listing_count          int64
price_increased_count      int64
price_reduced_count        int64
pending_listing_count      int64
average_listing_price    float64
total_listing_count        int64
dtype: object

In [50]:
# Convert Date to a datetime column
housing_df["date"] = pd.to_datetime(housing_df["date"])
housing_df.dtypes

date                     datetime64[ns]
metro_area/city                  object
median_listing_price            float64
active_listing_count              int64
median_days_on_market           float64
new_listing_count                 int64
price_increased_count             int64
price_reduced_count               int64
pending_listing_count             int64
average_listing_price           float64
total_listing_count               int64
dtype: object

In [51]:
# Display new DataFrame
housing_df.head()

,date,metro_area/city,median_listing_price,active_listing_count,median_days_on_market,new_listing_count,price_increased_count,price_reduced_count,pending_listing_count,average_listing_price,total_listing_count
0,2021-06-01,"new york-newark-jersey city, ny-nj-pa",617500.0,61846,55.0,26280,1020,9540,32230,1.260094e+06,94076
1,2021-06-01,"los angeles-long beach-anaheim, ca",1024500.0,13258,44.0,10096,476,1928,15494,2.507311e+06,28752
2,2021-06-01,"chicago-naperville-elgin, il-in-wi",354950.0,19089,33.0,17088,444,5712,25296,5.380922e+05,44385
3,2021-06-01,"dallas-fort worth-arlington, tx",387000.0,6850,29.0,9008,704,1924,14504,5.952097e+05,21354
4,2021-06-01,"houston-the woodlands-sugar land, tx",365995.0,13440,36.0,11368,1748,3636,17155,5.565350e+05,30595

In [52]:
# Extract the year from the 'date' column.
housing_df["year"] = pd.DatetimeIndex(housing_df['date']).year
housing_df.head()

,date,metro_area/city,median_listing_price,active_listing_count,median_days_on_market,new_listing_count,price_increased_count,price_reduced_count,pending_listing_count,average_listing_price,total_listing_count,year
0,2021-06-01,"new york-newark-jersey city, ny-nj-pa",617500.0,61846,55.0,26280,1020,9540,32230,1.260094e+06,94076,2021
1,2021-06-01,"los angeles-long beach-anaheim, ca",1024500.0,13258,44.0,10096,476,1928,15494,2.507311e+06,28752,2021
2,2021-06-01,"chicago-naperville-elgin, il-in-wi",354950.0,19089,33.0,17088,444,5712,25296,5.380922e+05,44385,2021
3,2021-06-01,"dallas-fort worth-arlington, tx",387000.0,6850,29.0,9008,704,1924,14504,5.952097e+05,21354,2021
4,2021-06-01,"houston-the woodlands-sugar land, tx",365995.0,13440,36.0,11368,1748,3636,17155,5.565350e+05,30595,2021

In [53]:
# Filter to show only data from 2019
housing_df_filtered = housing_df[housing_df['year'] == 2019]
print(housing_df_filtered.shape)
housing_df_filtered.head()

(11004, 12)

,date,metro_area/city,median_listing_price,active_listing_count,median_days_on_market,new_listing_count,price_increased_count,price_reduced_count,pending_listing_count,average_listing_price,total_listing_count,year
16506,2019-12-01,"new york-newark-jersey city, ny-nj-pa",549999.5,65994,83.5,10272,428,7132,16934,1.110110e+06,82928,2019
16507,2019-12-01,"los angeles-long beach-anaheim, ca",877500.0,17466,75.5,4632,300,1972,11449,2.112489e+06,28915,2019
16508,2019-12-01,"chicago-naperville-elgin, il-in-wi",299250.0,31563,68.5,7588,240,5440,12497,4.389860e+05,44060,2019
16509,2019-12-01,"dallas-fort worth-arlington, tx",335500.0,19493,64.5,5780,680,5240,9232,4.688301e+05,28725,2019
16510,2019-12-01,"houston-the woodlands-sugar land, tx",299994.0,26614,69.0,7032,836,5988,9069,4.375289e+05,35683,2019

In [54]:
# Group by metro_area/city - index split separately 
grouped_housing_df = housing_df_filtered.groupby(['metro_area/city'],axis=0,as_index=False).mean()
grouped_housing_df.head(20)

,metro_area/city,median_listing_price,active_listing_count,median_days_on_market,new_listing_count,price_increased_count,price_reduced_count,pending_listing_count,average_listing_price,total_listing_count,year
0,"aberdeen, sd",182846.428567,161.750000,81.333333,43.333333,0.000000,36.000000,0.333333,224213.729800,162.083333,2019.0
1,"aberdeen, wa",243286.190475,336.000000,71.375000,110.000000,4.333333,65.000000,125.666667,281836.496283,461.666667,2019.0
2,"abilene, tx",214853.273808,561.166667,66.416667,195.000000,3.333333,149.000000,282.000000,247640.667450,843.166667,2019.0
3,"ada, ok",155062.500008,151.666667,67.500000,44.333333,0.000000,20.666667,53.666667,192856.850308,205.333333,2019.0
4,"adrian, mi",169820.238100,428.416667,64.416667,123.333333,2.000000,83.666667,31.250000,221564.868992,459.666667,2019.0
5,"akron, oh",165456.904758,1701.500000,54.166667,798.666667,7.666667,563.333333,1187.583333,244281.999525,2889.083333,2019.0
6,"alamogordo, nm",185736.904767,410.666667,99.833333,90.666667,0.000000,48.333333,104.166667,220033.831333,514.833333,2019.0
7,"albany, ga",120405.726192,545.666667,91.500000,126.666667,2.000000,109.000000,17.583333,150925.848925,563.250000,2019.0
8,"albany, or",349433.928575,450.583333,50.375000,232.333333,8.000000,143.000000,231.916667,448459.134575,682.500000,2019.0
9,"albany-schenectady-troy, ny",297317.107150,3856.000000,83.000000,1118.666667,31.666667,887.333333,2326.666667,342436.266492,6182.666667,2019.0
10,"albemarle, nc",271732.053567,300.083333,98.291667,63.000000,3.000000,58.666667,95.333333,386728.569967,395.416667,2019.0
11,"albert lea, mn",153208.928567,101.333333,70.541667,32.666667,0.000000,20.000000,42.666667,183790.063642,144.000000,2019.0
12,"albertville, al",231326.190483,358.000000,94.416667,86.333333,2.333333,74.666667,1.250000,320147.240817,359.250000,2019.0
13,"albuquerque, nm",268651.244050,2470.083333,54.958333,1104.333333,53.666667,861.000000,1882.583333,350132.412267,4352.666667,2019.0
14,"alexandria, la",188410.416667,488.750000,87.208333,109.666667,1.333333,108.000000,143.583333,228619.211392,632.333333,2019.0
15,"alexandria, mn",283441.071433,259.416667,85.250000,67.333333,0.000000,52.333333,21.583333,321543.738508,281.000000,2019.0
16,"alice, tx",174110.714283,120.333333,95.833333,24.666667,0.000000,18.000000,24.750000,220762.009358,145.083333,2019.0
17,"allentown-bethlehem-easton, pa-nj",226642.136900,3770.500000,68.166667,1336.000000,36.000000,925.333333,186.000000,291950.826308,3956.500000,2019.0
18,"alma, mi",109200.892864,128.666667,74.916667,36.000000,0.000000,23.000000,15.916667,139505.178808,144.583333,2019.0
19,"alpena, mi",133663.095242,221.750000,88.625000,49.666667,0.000000,26.000000,34.500000,194194.917825,256.250000,2019.0

In [55]:
# Check types
grouped_housing_df.dtypes

metro_area/city           object
median_listing_price     float64
active_listing_count     float64
median_days_on_market    float64
new_listing_count        float64
price_increased_count    float64
price_reduced_count      float64
pending_listing_count    float64
average_listing_price    float64
total_listing_count      float64
year                     float64
dtype: object

In [57]:
# create new df with DF cities  
metro_name_df = pd.DataFrame(grouped_housing_df['metro_area/city'])
print(metro_name_df.shape)
metro_name_df

(917, 1)

                       metro_area/city
0                         aberdeen, sd
1                         aberdeen, wa
2                          abilene, tx
3                              ada, ok
4                           adrian, mi
..                                 ...
912  youngstown-warren-boardman, oh-pa
913                      yuba city, ca
914                           yuma, az
915                     zanesville, oh
916                         zapata, tx

[917 rows x 1 columns]

In [59]:
# create new DF with columns needed for ML - Drop: (year, price red, price inc, pending listing)
ml_housing_df= grouped_housing_df[['median_listing_price','active_listing_count','median_days_on_market','new_listing_count','average_listing_price','total_listing_count']]
print(ml_housing_df.shape)
ml_housing_df.head()

(917, 6)

,median_listing_price,active_listing_count,median_days_on_market,new_listing_count,average_listing_price,total_listing_count
0,182846.428567,161.750000,81.333333,43.333333,224213.729800,162.083333
1,243286.190475,336.000000,71.375000,110.000000,281836.496283,461.666667
2,214853.273808,561.166667,66.416667,195.000000,247640.667450,843.166667
3,155062.500008,151.666667,67.500000,44.333333,192856.850308,205.333333
4,169820.238100,428.416667,64.416667,123.333333,221564.868992,459.666667